import React from "react";
import "./Why.css";

const Why = () => {
  return (
    <main className="main-content">
      <h1 className="heading">Невероятный рассказ</h1>
      <p style={{fontWeight: 'bold'}}>
      Долгое время я стремился найти себя в мире программирования, скитаясь по различным технологическим пейзажам и исследуя самые разнообразные области разработки. В моем кармане мелькали языки Java, Python и C++; глаза метались по бескрайним пескам веб-разработки, мобильных приложений, бэкенда и обучения машин. И с каждым пройденным путем возрастало желание найти то место, которое я мог бы назвать своим пунктом назначения.

На своем вдохновляющем пути, я увлекался разработкой серверных приложений, вращаясь во власти Java и Node.js, чтобы почувствовать все аспекты, которые образуют мир разработки поддерживающих структур. Они были по эффективности, но отсутствие воздействия на визуальную составляющую делало мой путь проклятой монотонной рекой.

Однажды, я остановил свой выбор на фронтенд-разработке. Ни секунды не колеблясь, я решил открыть свое сердце для изучения языков, таких как HTML, CSS и JavaScript, которые тем или иным образом воплощали идею красоты и функциональности в изящном танце. Вот в этом я обрел свою настоящую страсть, интерактивные пользовательские интерфейсы рождали новую форму энергии во мне.

Фронтенд предоставил мне возможность создавать великолепные веб-приложения, оживлять неподвижные страницы и сопрягать их с динамичными взаимодействиями пользователя, собирать мириады фрагментов разноцветных пикселей в интригующую картину, которая рождала умиление у пользователей. Именно это направление стало для меня лучшим выбором.

Теперь, как фронтенд-разработчик, я стремлюсь передать свою страсть и любовь к веб-технологиям в каждый проект,и делать мир интернета немножечко красивее и удобнее.
      </p>
    </main>
  );
};

export default Why;
